Show / Hide Table of Contents
Namespace IdeaStatiCa.Plugin.Grpc
Classes
GrpcClient
Client implementation for the Grpc connection.
GrpcMessage
GrpcReflectionServiceContractReflection
Holder for reflection information generated from Grpc/GrpcReflectionServiceContract.proto
GrpcReflectionServiceFactory
Creates a dynamic instance of the interface implemented on server to proxy the calls from grpc client service to grpc server.
GrpcServer
Server implementation for the Grpc connection.
GrpcService
GrpcService.GrpcServiceBase
Base class for server-side implementations of GrpcService
GrpcService.GrpcServiceClient
Client for GrpcService
GrpcSynchronousClient
GrpcClient implementation that waits for message callbacks.
Interfaces
IGrpcMessageHandler
Non generic implementation of IGrpcMessageHandler<T>
IGrpcMessageHandler<T>
Handles communication over Grpc.